app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "1998-05-20"], ["updated_at", "2020-09-15 03:58:21.519165"], ["id", 3]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(book_params)

INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    if @book.save